[{
  "_id": {
    "$oid": "67517f40a4041e1ef91aef41"
  },
  "forId": "D001",
  "ingredients": [
    "Citrus: There is lots of citrus in the dressing with the orange juice and zest plus lemon juice and zest. This not only adds a bright, fresh flavor but the citric acid helps keep the fruit from turning brown.",
    "Honey: Honey acts as a natural sweetener in the citrus dressing, balancing the tartness of the citrus juices. It enhances the overall flavor and adds a touch of sweetness without overpowering the natural fruit flavors.",
    "Vanilla: The addition of vanilla extract brings a warm and aromatic note to the fruit salad. It brings out the warmth in the honey and balances all the sweet fruity flavors.",
    "Tangerine: Tangerines are great because they are similar to oranges but they are smaller and a bit more tart to balance all the other sweeter fruits. You can also use mandarin oranges or clementines.",
    "Pineapple: You want to use fresh pineapple if possible because not only is it more flavorful but it is more firm. Slice it into bite sized chunks that are uniform so they get incorporated well.",
    "Kiwi: One thing that makes this fresh Fruit Salad recipe stand out is the deliciously tart kiwi. They add a different flavor that stands out plus the bright green adds a nice color contrast.",
    "Berries: Plenty of fresh strawberries and fresh blueberries make this rainbow salad look stunning plus who doesn’t love fresh berries?!",
    "Grapes: Red grapes to add some color contrast but you could use whatever grapes you like better. They add a crisp, juicy and sweet burst of fruity goodness in this salad."
  ]
},
{
  "_id": {
    "$oid": "67517f40a4041e1ef91aef42"
  },
  "forId": "D002",
  "ingredients": [
    "Large Shrimps: Our tasty and large shrimps are also deliciously pleasant to eat thanks to their largeness so they don't become tough.",
    "Boneless Skinless: Our boneless skinless Chicken are cut into evenly sized pieces.",
    "Pineapple: We add a sweet, delicate and charred taste with our Chunks of fresh Pineapple.",
    "Zucchini: Zucchini are easy colored summer product event out of the season!",
    "Bell Peppers: Bell Peppers are a nice additional ingredient choice for crunch taste and color.",
    "Red Onion: Our red onion will add more color and attractive smell!",
    "Cherry Tomatoes: Our fresh selected cherry tomatoes add brightness and acidity to our meals.",
    "Fresh Herbs: How can we forget our Fresh Herb ? It adds freshness, flavor, and mix very well with meat.",
    "Marinade: Last but not least, we mix our great skew with a homemade marinade made with Honey Soy Sauce, Sesame Oil, Hoisin Sauce, Shallot, Garlic Cloves and Fresh Ginger."
  ]
},
{
  "_id": {
    "$oid": "67517f40a4041e1ef91aef43"
  },
  "forId": "D003",
  "ingredients": [
    "Cucumbers: English, Persian, and small-field cucumbers are the best in raw salads as they’re nearly seedless, and the thin, mild-flavored skin doesn’t need to be peeled. You can use a large garden cucumber, but you may want to remove the skin and scoop out the watery seeds before chopping.",
    "Tomatoes – I used halved cherry tomatoes, but grape tomatoes or any sweet-acidic tomato with low water content, like plum or aroma, will work.",
    "Red bell pepper – These are the sweetest, best-tasting bell pepper. So I don’t recommend substituting them for a different color, but you can always add orange and yellow bell peppers if you like.",
    "Radishes – They add a pleasantly peppery-sweet bite, distinct crunch, and a pop of pink, red, or purple.",
    "Celery – Crunchy celery is a perfect addition to this fresh salad. It’s slightly sweet and adds a bright green color to the dish.",
    "Onion – Thinly sliced red or sweet white onions are best. However, chopped chives are a great way to add complexity without pungency if you don’t like raw onion.",
    "Garlic cloves – Raw garlic is often overlooked as a salad ingredient. However, a couple of minced cloves add fantastic flavor without overpowering the other ingredients.",
    "Fresh herbs – A handful of fresh parsley and dill brightens up every bite with even more fresh flavor.",
    "Salad dressing – I like tossing the veggies and herbs with a straightforward mixture of balsamic vinegar and extra-virgin olive oil. This basic recipe lets the raw ingredients shine."
  ]
}]